---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
UpdaterRegistry..::..GetRegisteredUpdaterInfos Method
UpdaterRegistry Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetRegisteredUpdaterInfos()()()() | Returns UpdaterInfos for all the application-wide updaters. |
|  | GetRegisteredUpdaterInfos(Document) | Returns information about all updaters applicable to the given document. |

# See Also

UpdaterRegistry Class

UpdaterRegistry Members

Autodesk.Revit.DB Namespace